[["About what proportion of the population of the US is living on farms?", "Correctly label the brain lobes indicated on the diagram below", "Define compound interest.", "Define four types of traceability.", "Define mercantilism.", "Define stream bank, floodplain and substrate.", "Define the meaning of the Olympic Motto.", "Draw and label a diagram of a typical stream.", "Draw the basic outline of a page of notes using the Cornell Method?", "Draw the block diagram of the central processing unit", "Draw the flow chart of the PNK system", "How many instructions in the instruction set of RISC computer?", "How many kilometers from your home to the university", "How many loop statement available in c++?", "How many states are there in USA", "How many years does this animal live?", "How much data can be stored in the cach memory", "How much did he pay for his car", "How much is your weight", "How much time did he took to build a house", "How much water does an elephant drink", "Identify a phrase as a simile", "Identify a property (commutative, additive, etc(", "Identify fractions from a pictorial representation", "Identify ordinal positions", "Identify the correct definition of osmosis.", "Identify the five major prophets of the Old Testament.", "Identify the part of a eukaryotic cell.", "Identify the standard peripheral components of a computer.", "Identify which word begins with the same sound as the s in sun (Knowledge of letter s)", "in which continent does the state of suriname fall", "in which countries is arabic language spoken", "In Which part of the world does he live", "Label any Olympic sporting apparatus with design features.", "Label the parts of the following insects: Grasshopper", "Label the parts of the microscope shown on the right", "List four types of clauses mentioned in the article", "List reserved words in C programming.", "List the characteristics peculiar to the Cubist movement.", "List the levels in Bloom's Taxonomy.", "List the procedure to draw a mixed potential or Evans' diagram", "List the steps involved in titration.", "List three characteristics that are unique to the Cubist movement.", "List three predominant economic systems that exist", "Look at the symbol. What is the symbol’s purpose on a map?", "Make a list of facts you learned from the story.", "Name 5 steps that follow the taking of notes (within 24 hours or less)?", "Name the artist who painted the Mona Lisa.", "Name the food groups and at least two items of food in each group.", "Name the four major food groups.", "Name the main characters in the story.", "Name the property that states that", "Please label the diagram below:", "Recall basic math facts", "Recall locations of a historical events", "Recall the definition of the formula datatype from your assignment 2.", "Recall the equation for the Ideal Gas Law.", "Recall the following pictoral example of an implementation of some queue operations", "recall the supply voltage constraints", "Recite a policy of immigration in Europe .", "Recite the poem \"Auto Wreck\".", "Recite the principles of the Data Protection Act.", "Recite the the Gaussian law", "State four attributes of well engineered software.", "State how to find a word in a dictionary", "State the characteristics of each type of corrosion testing studied", "State the definition of application in Bloom's Taxonomy.", "State the formula for the area of a circle", "State the guidelines to design an anodic protection system", "State the pattern for expressing time in French.", "State the rule for balls and strikes in baseball.", "State the rule for using a semicolon in a sentence.", "What are major facts about particular cultures and societies", "What are the major products and exports of countries", "What are the representational symbols on maps and charts", "What are the structure or functions of Congress", "What are the units of corrosion penetration rates? Relate these to Faraday's law", "What does ICT stands for.", "What is your family name", "What is a global variable?", "What is a textual index", "What is the setting of To Kill a Mockingbird?", "What is the title of the first movie you saw", "What season are we in right now?", "when did saudi arabia start using internet", "when did the first saudi radio station open", "When did the second world war happen", "When did you born ?", "when was the first airport in the yemen built", "when was the UN formed", "Which of the following is the method for determining the volume of a cylinder?", "Which of the following item does not belong to the set ?", "Which of the two liquids is hypotonic", "which part of a data packet is used by a router to determine the destination network", "Which technology is used by laser printer", "Who is the first president of USA", "who is the founder of the kingdom of saudi Arabia", "who was the first man on the moon", "who was the first to compose in the arts of makamat", "Who was the writer of the Hamilton", "Compare Calliope with Howie. Use the word bank.", "Compare historical events to contemporary situations", "Complete an analogy (analogy tasks are inference tasks)", "Describe 4 types of coupling in software design.", "Describe how Phillip and Timothy survived on the Cay.", "Describe in prose what is shown in graph form.", "Describe in your own words how to borrow a book from the library.", "Describe in your own words how to copy text from one program into another.", "Describe in your own words what happens when a stream's velocity slows.", "Describe in your own words what is meant by a sprained ankle.", "Describe nuclear transport to a lay person.", "Describe the Pareto Principle in statistical software quality assurance.", "Describe what goes in each of the four areas on the first page of notes", "Describe what took place as the Hato was sinking.", "Describe how the linear polarization method can yield corrosion rates", "Describe the major clinical differences between visceral and somatic pain", "Briefly describe the author's approach to the liabilities of the GOTO statement", "Describe what happened at...?", "Determine the author’s point of view", "Determine the next number in a sequence", "Discuss the nature of socialism.", "Explain how Timothy saved Phillip's life.", "Explain in one's own words how to create a query in a database.", "Explain in your own words what a recessive gene is.", "Explain in your own words what do you mean by the term economics?", "Explain in your own words what is meant by mercantilism.", "Explain the causes of historical events", "Explain the communicative property.", "Explain the double meaning the author attributes to the term \"successive action descriptions\"", "Explain the possible uses described in class for the space to the left of the vertical line.", "Explain the process (paraphrase) for finding the perimeter of a rectangular garden", "Explain what a poem means.", "Explain what the author means by the statement \"our intellectual powers are geared to master static relations.", "Express your opinion of 'Drugs in Sport' through poetry.", "From a blueprint to describe the article depicted.", "Given a graph of production trends in automobiles, describe what the graph represents in a memo to your boss.", "Given these five corrosion inhibitors, V, W, X, Y, Z, identify which are passivators", "Illustrate this caption: \"Olympic as a Media Event in the Information Society\"", "Illustrate what you think the main idea was.", "In one sentence explain the main idea of a written passage.", "In one sentence illustrate the main point of a written passage.", "Interpret the pictures.", "Outline in your own words how the Leggo's Tomato Paste advertisement sells their product.", "Outline the most important insight of the tale.", "Outline the mechanisms employed by bacteria allowing them to evade phagocytic destruction.", "Outline an \"attack plan\" that will allow you to test your hypothesis using computational molecular modeling tools", "Paraphrase an important speech", "Paraphrase what Hamlet is saying in his soliloquy.", "Paraphrase the poem in your own words", "Paraphrase this poem about Sheik Schubli, explaining what he was saying about the characteristics of a friend", "Describe the output of this program fragment:", "Classify types of corrosion inhibitors", "would you classify the zener diode in this circuit as a series voltage regulator or a shunt voltage regulator", "Classify the following protocols: IP, TCP, HTTP according to the ISO OSI classification", "Classify the following substances as particle, atom, element, molecule, compound", "How would you classify the geographic location of your school", "Classify animals into two groups.", "Classify celebrations into family and community categories.", "Classify frogs toads and other amphibians.", "Restate main idea of story in own words.", "Restate the Olympic motto in your own words.", "Retell the story in your words.", "Rewrite the principles of test writing.", "Rewrite you predicted equation for the ideal gas law", "Rewrite the markov matrix to account for this slight change.", "Rewrite the sentence in your head, following the direction given below", "Rewrite a part in the poem using a different speaker", "Select the best title for a passage", "State in your own words the rule for balls and strikes in baseball.", "State in your own words where in the library to find previous issues of journals that are no longer in the display racks.", "Can you state in your own words what the problem is asking you to do", "State in your own words what the author means when he says", "Summarize a historical document", "Summarize a story in own words.", "Summarize Jem’s beliefs about Boo Radley", "Summarize the basic tenets of collaborative conservation.", "Summarize the basic tenets of deconstructionism.", "Summarize this magazine article.", "Tell how Phillip kept himself alive after Timothy died.", "Tell in your own words how the setting of the story made it more interesting.", "Tell in your own words the beginning of the book.", "In your own words, tell what is meant by the definition of an isosceles triangle.", "In your own words, how would you define transferable skills", "Translate a written text aloud from L2 to English.", "Translate an equation into a computer spreadsheet.", "Translate an equation into a spreadsheet formula.", "Translate the following passage from The Iliad into English.", "Use the E-pH or Pourbaix diagram of Cr to determine the control current and potential for the anodic protection of a S43000 stainless steel vessel.", "Compare and contrast two treatments of either drapery or animals by Greek sculptors, establishing their artistic contexts", "Briefly compare this way of testing the satisfiability of to the more standard way using SLD Resolution, as in Prolog", "How would you compare SAS with the Visual Basic Application and SPSS for the processing and analysis of mainframe data", "Describe and compare the role of Islamic law in the legal systems of Malaysia and Pakistan", "Express the rule in function notation", "Express the following systems in matrix form", "Express the following percentages as fractions in simplest form", "Explain the whole method of crushing", "In your own words, how would you summarize the story up", "Summarize the main point of these two texts in your own words", "Outline the aim of two studies within the", "Outline your experience in working with service users", "Apply laws of statistics to evaluate the reliability of a written test.", "Apply shading to produce depth in drawing.", "Apply the rule of law to a new situation", "Apply the storytelling technique here to a little story of your own.", "Apply your understanding the Olympic spirit to develop a new motto or slogan.", "Show the value of x after running this program fragment", "Calculate for x in the following equation: 12x=36", "Calculate the deflection of a beam under uniform loading.", "Calculate the number of sacrificial anodes that would be required to form a calcareous deposit on a steel pile immersed in seawater.", "Calculate the rate of habitat fragmentation within the Colorado Front Range in the last decade.", "Can you apply the method used to some experience of your own . . .?", "Can you group by characteristics such as . . .?", "Categorise the pictures and add them to the wall display.", "Choose a country that does not compete at the Olympics and explain why that country is not an Olympic member.", "Choose any U.S. president and explain how he exercised his power as Commander in Chief of the Armed Forces.", "Compute the area of actual circles.", "Compute the volume of a cylinder", "Construct a model to demonstrate how it will work.", "Demonstrate how the seasons occur.", "Demonstrate how this could work in an industry setting?", "Demonstrate using the OPAC and your knowledge of library organization to find a book about turtles.", "Demonstrate how your unit’s specific student learning outcomes are linked to the mission of UAM.", "Derive a kinetic model from experimental data.", "Describe an experiment to answer the question of the effects of weight on the fall of an object.", "Construct a market strategy for your product using a known strategy as a model.", "Construct a simple payroll program that computes net pay for those working 40 hours or less and net pay for those working over 40 hours.", "Draw 3 pictures showing the beginning, middle and ending of the story.", "Draw a picture of the bears' house.", "Draw a picture of the gown Cinderella wore to the ball.", "From the information given, can you develop a set of instructions about . . .?", "How could someone modify the Cornell Method to make it effective for researching a topic for a paper?", "How might lifestyles in the United States be modified if a more socialistic system were adopted?", "If notes are available on the professor’s website, how should those notes be used?", "In a teaching simulation with your peers role-playing 6th grade students, demonstrate the principle of reinforcement in classroom interactions and prepare a half page description of what happened during the simulation that validated the principle.", "Make a diorama to illustrate an important event.", "Make a paper-mache map to include relevant information about an event.", "Make a scrapbook about the areas of study.", "Make up a puzzle game using the ideas from the study area.", "Model an Olympic Village for the new Millenium.", "Participate in a mock election", "Predict what happens to X if Y increases.", "Pretend you are one of the characters in the book. Write a diary about the happenings in your life for two consecutive days.", "Relate the principle of reinforcement to classroom interactions.", "Relate topographic map to field features", "Relate your most powerful story where your use of technology in the classroom has yielded a significant outcome with a student or students", "How would you relate position concept with position strategy", "Show, through role-play, the final scene in the novel.", "Solve a math problem using familiar procedure or formula", "Solve for the ten following fraction multiplication problems. Please make sure to show all your work.", "Would you solve these two problems using similar approaches", "Use Laplace to solve the following problems", "Can you solve the following problem", "How to specify the impact energy and impact test temperature of the material in the Code", "Specify the thickness of a galvanized coating based on atmospheric data? (level 2)", "Specify the thickness of a galvanized coating based on atmospheric data? (level 2)", "How does one specify the syntactical restrictions", "Specify a deterministic finite automaton (DFA) recognizing the", "Take a collection of photographs to demonstrate a particular point.", "Use a costing model to compute prices on goods to maximise profits and minimise costs.", "Use a manual to calculate an employee's vacation time.", "Use the distance travelled and cost of petrol to calculate the cost of a coach trip using a spreadsheet.", "Use the rule for a semicolon in a sentence.", "What factors would you change if . . .?", "What questions would you ask if . . .?", "Who can use what we know about sonnets and finish this poem?", "Would this information be useful if you had a . . .?", "Sketch a prediction of the field lines for the arrangement of electrodes shown in Figure 2", "Sketch the blackbody curves for radiation emitted from the Sun and the Earth", "Sketch a typical absorption process in a packed column with regeneration in form of", "sketch a graph of velocity versus time for the upward and downward parts of a ball’s flight", "How do teenagers use code in emails and instant messages?", "Use the second-derivative test to determine whether critical points where f0(x) = 0 yield relative maxima or relative minima", "Use the unification algorithm to determine whether the following two terms are uni_able. Show intermediate step", "Use tableau methods to prove that the following tableau is valid.", "Use a sketch too find the exact value of each expression", "Use Gauss’ Law to find the electric field between the plates when the charge on them is Q", "What happens if you restrict a determinental process to a subset R S?", "What would happen if the rainfall doubled in your state next year", "What happens if you change the direction of the displacement (but not its size)?", "What would you do if a heavy growth of bacteria had occurred", "What would result if …", "What approach would you use to prove the truth of the below statement", "Construct one Turing Machine for computing each of the following functions", "Construct a Venn diagram to determine the validity of the given argument.", "Construct a dictionary and a truth table to determine if the following statements are logically equivalent", "How can we construct H given I, B and E?", "Construct a family of networks to demonstrate that the number of different mincuts in a network can be exponential in the size of the network", "How do you construct foliations on a given manifold M?", "How to Construct the Optimal Maintenance Problem", "How to construct simple solutions when problems are complex?", "Construct the 4-Bit Ripple carry Adder Circuit", "Construct an analog circuit with the following specifications", "Construct the Data Path of the RISC Processor given in the previous question", "How do we construct agents that can deliver. “good” assistance", "How to construct the selected information system", "Show how they have used creative writing strategies appropriate to the format", "Show how to modify Fitch's algorithm given in class today to accommodate non-binary", "Show how E-CRM can be used to improve marketing positioning as explained in the article", "How would you show your understanding of the ABC process", "Show me how you would check the brake lights are working on this car", "Analyze safe and dangerous aspects of these features.", "Analyze the characteristics of frogs.", "Analyze the movements and sounds of a frog.", "Analyze the problem, identifying its variables.", "Break down the components of a standard film camera and explain how they interact to make the machine work.", "Break down the main actions of the story.", "By comparing the map of the tectonic plates to the earthquake map, what inferences can you make?", "Can you compare your . . . with that presented in . . .?", "Can you distinguish between . . .?", "Can you explain what must have happened when . . .?", "Can you find four different feelings Pa Lia had during the story?", "Compare and contrast animals that the class has made.", "Compare and contrast our school to other communities.", "Compare and contrast preview questions, clarifying questions and anticipated exam questions, including how each relates to the notetaking process?", "Compare and contrast the waterfall model with the prototyping model.", "Compare and contrast two characters in the book.", "Compare fall and spring", "Compare herbatious and carnivorous animals on a Venn diagram.", "Compare how different children come to school.", "Compare the place where the story happened with where you live.", "Compare this book to the last book you read.", "Compare three celebrations using a Venn diagram.", "Compare two dog food commercials. What is the difference between them and how do they both sell their products?", "Compare two of the characters in this book.", "Conduct an investigation to produce information to support a view.", "Contrast building in the coastal zone with building in a river floodplain.", "Contrast Olympic athletes of today with athletes of past Olympic games.", "Differentiate between .call by value and call by reference.", "Differentiate printf function calls for displaying prompts and for echoing data.", "Distinguish between micro and macro economics.", "Distinguish facts from hypotheses", "Divide the story into initiating event, rising action, climax, and falling action", "Examine what helps to make a good Olympics? Think about money, schedules, sports and people.", "Explain the term conjugal families, by making reference to the different types of societies to which they could belong.", "analyze the positive and negative points presented concerning the abolition of guns and write a brief (2-3page) narrative of your analysis.", "Differentiate the passages that attacked a political opponent personally, and those that attacked an opponent's political programs.", "How does your pet differ from other animals?", "How does...compare/contrast with...?", "How is . . . similar to . . .?", "How was life different in your town 100 years ago?", "How was this similar to . . .?", "How would this story be different if it had happened in a different country?", "How would you distinguish between polymyositis and viral myositis in a 42-year-old man with weakness and a rash?", "If your story happened in a foreign land, compare that land to the United States.", "If your story occurred long ago, compare that time with today in a good paragraph. If it was a modern story, compare it with a long time ago and tell what would be different.", "Investigate innovations that can enhance future Olympics.", "Make a diagnosis or analyze a case study.", "Select the athlete of the century and analyze why you chose this person.", "If interest were compounded monthly instead of daily, what would the difference in interest be?", "What are the parts or features of...?", "Distinguish between the following giving suitable examples", "Distinguish between abstract date types (ADTs) and implementations of ADTs", "How do you distinguish between the binge-eating/purging type of anorexia nervosa and bulimia nervosa, purging type", "How does Tdap differ from Td vaccine", "How does autonomy differ with age", "In what ways do female offenders differ from male offenders", "in what ways trajectory patterns differ according to ABC", "How do psychologists differ in their general attitudes toward third party presence", "How did Chinese newspapers differ from US", "How does public health reporting differ today from reporting two years before", "How does an endorsement differ from a teaching certificate", "How do we differentiate between genuine buyer and undercover buyer", "How do we differentiate between an interview and an interrogation?", "Differentiate between the following terms along with appropriate examples", "Differentiate the following functions using the quotient rule", "Can you differentiate between ethnic Chinese and ethnic Koreans", "How would you differentiate obstructive apneas from central apneas", "How would you differentiate a project from a program", "How is scientific progress similar to Darwinian evolution according to Kuhn", "in what ways is oxyperoxidase similar to other oxygenated heme proteins, and how does it differ", "In what ways are foxes similar to wolves and dogs", "How are the adolescents with ASD similar of different from each other in their sources of communication breakdowns ?", "Examine the data in the EMPLOYEES and DEPARTMENTS tables", "Examine the differences between the model excluding the most influential observation and the model including all observations.", "Critically examine the strengths and weaknesses of the positivist paradigm", "Examine differences between the means of each individual switching factor.", "Examine carefully the given map extract on the following page to help you work out the exercise below.", "Inspect each of these Boolean expressions, and determine whether each one is a sum of products, or a product of sums", "Inspect the size of the loaded data: how many objects and variables does the iris data matrix contain?", "Can you distinguish for me between what is reasonably achievable and what are exaggerations", "Can you distinguish aged rums from unaged rums by smell", "Can you distinguish pot still rums from column still rums by taste", "Inspect the pattern of GPS positions relative to the “known” published value", "How does your agency inspect against its expectation for operators", "How to inspect and maintain fresh water plumbing systems properly", "Can you analyze the fractures and determine which should be repaired surgically", "Can you please analyze modern contemporary culture and tell me how your work plays a significant part in the remains of our post-modernist culture ?", "How effectively did students analyze course content on race, class, and privilege through autobiographical reflection", "How do you analyze a marginally RCT", "Contrast the treatment of \"well known\" trademarks provided by Paris Article and by TRIPS Article", "Contrast the Valles Marineris on Mars with the Grand Canyon", "How does Hawaii contrast and compare to Florida?", "Investigate whether or not the system can be solved for x; y; z", "Investigate (pointwise) convergence and absolute convergence of the given series of functions", "How would you investigate this patient", "How would you investigate this abnormality", "What can I do to investigate this problem further", "how the investigation was undertaken", "How would you differentiate between heterodox and mainstream", "How do I differentiate between \"deceive\" and \"cheat on\"?", "Apply and integrate several different strategies to solve a mathematical problem (not according to one formula(", "Can you create new and unusual uses for . . .?", "Can you design a . . . to . . .?", "Can you develop a proposal which would . . .?", "Can you invent another character for the story?", "Can you see a possible solution to . . .?", "Can you write a new recipe for a tasty dish?", "Choose a character. Rewrite a scene from the story from this character's point of view.", "Combine any two sports to develop a new Olympic sport.", "Combine elements of drama, music, and dance into a stage presentation.", "Compose a class story.", "Compose a dialogue between Atticus Finch and Tom Robinson when they first met.", "Compose a rhythm or put new words to a known melody.", "Compose a simple rap or rhyme about zoo animals.", "Compose music for a frog play.", "Compose a complete C program that reads text strings from a text file into a suitable data", "Compose a device that would assist an athlete in their training.", "Compose an original work which incorporates five common materials in sculpture.", "Compose your own note-taking design that incorporates all theadvantages of the Cornell Method.", "Create a chart that compares things that use electricity and things that do NOT use electricity.", "Create a new product. Give it a name and plan a marketing campaign.", "Create a new song for the opening line of \"Mary had a little lamb\".", "Create a set of guidelines to determine the points of a plant susceptible to localized corrosion.", "Create a storyboard for a sequel to your book. Use the same characters.", "Create an equation to represent the solution to this problem.", "Create and perform a play about frogs.", "Create plan of local environment by drawing around boxes.", "Design a building according to given specifications", "design a cost effective strategy to generate reliable data.", "Design a machine to perform a specific task.", "Design a new animal to live in the jungle.", "Design a poster for this book.", "Design a testing scenario to assess the susceptibility of an alloy to be used in a given environment?", "Design and make an animal that moves.", "Design costumes for the characters.", "Design the architecture of the software system based on the requirements defined in the Software Requirement Specification document", "Develop a hypothesis.", "Develop a plan for a new Olympic Bid System.", "Develop a SQA Plan for a software development project which is defined in the attached document.", "Develop a way to teach the concept of \"adjectives\".", "Develop one plausible ending for all three short stories below.", "Devise a new economic system based on the ones that already exist.", "Devise plans to market or make artwork more valuable.", "Draw a painting that uses various principles of perspective to achieve its effect.", "Explain how the biological concept of symbiotic relationships could be used to help solve socially created problems like water pollution, overflowing garbage landfills, or homelessness.", "Explain why it is likely that a matriarchal family system would be found in a matrilocal or matrilineal society.", "Following the identification of the forms of corrosion that were involved in a failure, recommend a solution to avoid this failure?", "Given two opposing theories design an experiment to compare them.", "How could we determine the number of pennies in a jar without counting them?", "How could you re-write this story with a city setting?", "how do the clauses and expressions given in the article which replace GOTO statements, lead to the three traditional control statements", "How many ways can you . . .?", "How would the U.S.A. be different if the South had won the Civil War?", "How would you change the story to create a different ending?", "How would you create/design a new...?", "How would you restructure the school day to reflect children's developmental needs?", "Identify one problem in the book and give an alternate solution one not given by the author.", "If you had access to all resources how would you deal with . . .?", "Integrate training from several sources to solve a problem.", "Invent a machine to do a specific task.", "Justify your choice of data structure.", "Make a radio announcement that advertise the book. Write it out.", "Make up a new language code and write material using it.", "Name one character. Rewrite the story from this character's point of view.", "Organize this book into three or more sections and give your own subtitle for each section.", "Plan a research paper on a given historical topic", "Predict the differences of a planet with no seasonal changes.", "Prepare a book jacket that illustrates the kind of book as well as the story.", "Pretend you are a librarian recommending this book to someone. Write a paragraph telling what you would say.", "Revise and process to improve the outcome.", "Revise how to complete a complex task in order to improve the outcome.", "Revises and process to improve the outcome.", "structure, sorts the list in ascending order, displays the list on the screen and stores the list", "Suppose Phillip wasn't rescued shortly after Timothy's death. How long could he have survived?", "Using information from the book about one of the main characters, rewrite the ending of the book.", "What ideas can you add to...?", "What might happen if you combined...?", "What solutions would you suggest for...?", "What would happen if . . .?", "What would you predict/infer from...?", "Why don’t you devise your own way to deal with . . .?", "Why not compose a song about . . .?", "Write a C program that accepts integer inputs from the screen, computes the total and average values; and displays the values on the screen.", "Write a letter to the editor on a social issue of concern to you.", "Write a logically organized argument in favor of a given position.", "Write a poem about this book.", "Write a set of rules to prevent what happened in the story.", "Write a short story relating a personal experience in the style of a picaresque novel.", "Write a song about 'Old MacDonald' who had a bulldozer instead of a farm.", "Write an essay in not more than 250 words about India and Technological Advancement. Use active voice as much as possible.", "How do you combine the results of various individual tests to determine whether a student can progress to a next semester / phase / year?", "How can we combine and abstract facts about a software system to create new knowledge?", "How to combine virtual symmetry and symbolic model checking effectively", "How do we efficiently combine multiple subject graphs to construct an aig with choice", "how do we devise a way to enforce the laws", "can you devise an explicit formula for", "Do you devise a systematic approach in order to get larger progressions", "Develop and execute a program for this exercise", "Develop a network based on the following information: Activity Immediate predecessors", "How could we develop a coherent measure of success for organisations engaged in this type of activity with young people?", "After designing an experiment, examining the results, and drawing conclusions, determines in what ways the experiment could be conducted more effectively in order to draw more productive conclusions in the future.", "After examining the videotape of a play in a football game, determine the degree to which the defensive team performed effectively and", "After solving a problem, determine the degree to which the problem was solved as efficiently as possible", "Appraise data in support of a hypothesis.", "Appraise the speech's effectiveness based upon the class' criteria.", "Are there students who should not use the Cornell method?", "Are you a . . . person?", "Assess the appropriateness of an author's conclusions based on the evidence given.", "Assess the importance of understanding seasonal patters.", "Assess the relative effectiveness of different graphical representations of the same data or biological concept.", "Assess the strengths and weaknesses of the current Olympics and recommend action that should be taken in future Olympics: What can be", "Award the contract to the best proposal. Rank the principles of \"good sportsmanship\" in order of importance to you.", "Can you defend the idea that Simon's incident with the pig's head is the most mystical in the story?", "Can you defend your position about . . .?", "Choose a paint schedule for the maintenance of an outdoor structure? (level 2)", "Choose and illustrate the two most important events in the story.", "Conclude and support which economic system leads to a higher standard of living.", "Construct a poster that will advertise your new food product in an exciting and irresistible way.", "Critique an experimental design or a research proposal.", "Critique the other student's (or your own) speech, based on the criteria we have studied this semester.", "Decide whether you are in favor of building on a floodplain; defend your position in a debate.", "Decide whether you could have survived on the island blind and alone. Write about things that would have been challenging making sure to", "Decide whether you learned enough about electricity from this book.", "Decide which candidate would best fill the position of principal.", "Decide which course of action was most effective", "Decide which method of solving a problem was most effective", "Defend the following claim: The Cornell method works so well that it could turn even a poor lecture into a valuable learning experience.", "Defend your use of a specific strategy in solving the problem.", "Describe the economic consequence of a neolocal society. Support your description with information you have learned from this course.", "Design a healthy menu that you think most people would enjoy using the healthy eating guide.", "Determine if a character’s actions were heroic", "Do you agree...?", "Do you think . . . is a good or a bad thing?", "Establish criteria for making this choice and defend your final selection.", "Evaluate a work of art, giving the reasons for your evaluation.", "Evaluate appropriate and inappropriate actions of characters.", "Evaluate board games and justify why rules are important.", "Evaluate the corrosion monitoring needs of a chemical processing plant", "Evaluate the level of galvanic coupling between two metals using basic kinetic information? (level 4)", "Evaluate two Internet sources of information about the Egyptians. Which would be a better choice for your purpose and why?", "Evaluate whether their model is a true representation of the local environment.", "Evaluate your own or a peer's essay in terms of the principles of composition discussed during the semester.", "Examine the stated positions of both major political candidates with regard to a particular issue and state good reasons (based on principles discussed in class) for why one candidates position is more likely to be effective than the other's.", "Explain and justify a new budget.", "Explain choices made in making recommendations to an end user.", "Given an argument on any position, enumerate the logical fallacies in that argument.", "Given the data available on a research question, take a position and defend it.", "Given the data we've looked at on this topic, evaluate how appropriate this conclusion is and defend your answer.", "Given the two solutions to the stated programming problem, rate the solutions in terms of efficiency and readability.", "Given three possible approaches to implement the defined system, discuss the possible advantages and disadvantages of each approach.", "Given two possible solutions, A and B, to solving the given software development problem, decide on the best solution. Give your justification.", "How effective are . . .?", "How would you decide about...?", "How would you feel if . . .?", "How would you have handled . . .?", "improved, reformed or rejected?", "In a given clinical situation, select the most reasonable intervention and predict the main effects and possible side effects.", "Is there a better solution to . . .?", "Judge aesthetic qualities and relationship to future values.", "judge the difficulty level for yourself.", "Judge the value of . . .?", "Judge whether it would be possible to survive on an island alone and blinded. Write about it.", "Judge whether Olympic Ideals are realistic or unrealistic for the contemporary elite athlete.", "Justify and nominate ways to prevent animal extinction.", "Justify the title To Kill a Mockingbird .", "Listen to two classmates conversing on tape and critique their performance on the basis of the skills covered this semester.", "Place the following in order of priority...", "Predict what will happen next in.", "Predict whether Phillip will ever go back to visit the Cay after several years of recovery. Assuming he gets his sight back.", "Recommend how our classroom or playground could be improved.", "Select the best proposal for a proposed water treatment plant.", "Select the most effective solution.", "suggest ways in which it could have responded more effectively", "decide about the most exciting part of the book. being sure to give at least three reasons why?", "Use a judge and jury to discuss the statement 'Children enjoy Anthony Browne's books because of the illustrations'.", "Using straight value depreciation, decide between two copper-nickel alloys for the design of a heat exchanger.", "Using the basic principles of socialism discussed in this course, evaluate the US economic system by providing key arguments to support your judgment.", "Was Hemingway a great American writer? First you will need to define greatness.", "What changes to . . . would you recommend?", "What criteria would you use to assess the validity of a business contract?", "What criteria would you use to assess...?", "What do you think about . . .?", "What is part of this book did you like best. Tell why you like it?", "What is the most important...?", "Which of the following actions would probably be least effective in determining the answer?", "Which of the two algorithms, bubblesort or quicksort, is more efficient? Justify your answer.", "Would you have liked to have had Cinderella for a sister? Explain why or why not.", "Write a list of criteria to judge the Willy raps.", "Revise the story and specify the type of audience that would enjoy this book.", "Estimate the epicentral coordinates of the earth-quake", "Estimate the risk of serious illness for consumers in different susceptible population groups", "Estimate expenditure on HIV/AIDS education", "Estimate the difficulty of the question", "Estimate roughly how long the collision process takes", "What do you think is the best thing about coming to Viestal?", "What do you think is the mass and why", "What do you think are the strengths of using integrated math in your program?", "Do you think that this statement conveys the idea that i am trying to portray", "How do you think the community should grow or change", "How Do You Think One Should Reason in Making Ethical Decisions in Business"], ["knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "knowledge", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "comprehension", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "application", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "analysis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "synthesis", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation", "evaluation"]]